runtime/qwen3.6-27b/bench-20260721-074143.log
Started: 2026-07-21T07:41:43+00:00
Command: vllm bench serve --backend openai-chat --host 127.0.0.1 --port 8000 --endpoint /v1/chat/completions --model qwen3.6-27b --tokenizer /root/models/Qwen3.6-27B --dataset-name random --random-input-len 32768 --random-output-len 1024 --num-prompts 100 --request-rate 1 --max-concurrency 8 --seed 1024 --trust-remote-code --extra-body \{\"chat_template_kwargs\":\{\"enable_thinking\":false\}\} --save-result --result-dir /root/models/tim_tmp/runtime/qwen3.6-27b --result-filename bench-20260721-074143.json

INFO 07-21 07:41:53 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 07-21 07:41:53 [__init__.py:46] - ascend -> vllm_ascend:register
INFO 07-21 07:41:53 [__init__.py:49] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
INFO 07-21 07:41:53 [__init__.py:238] Platform plugin ascend is activated
INFO 07-21 07:41:53 [platform.py:62] Breakable cudagraph is force disabled on Ascend because DeepSeek V4 PIECEWISE cudagraph is not supported yet.
2026-07-21 07:42:04,948 - 12351 - ServiceProfiler - INFO - VLLM_USE_V1 not set, auto-detected via vLLM 0.23.0+empty: default 1
INFO 07-21 07:42:05 [__init__.py:115] Registered model loader `<class 'vllm_ascend.model_loader.netloader.netloader.ModelNetLoaderElastic'>` with load format `netloader`
INFO 07-21 07:42:05 [__init__.py:115] Registered model loader `<class 'vllm_ascend.model_loader.rfork.rfork_loader.RForkModelLoader'>` with load format `rfork`
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xfffeed96fba0>, trust_remote_code=True, seed=1024, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=32768, random_output_len=1024, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=8, model='qwen3.6-27b', input_len=None, output_len=None, tokenizer='/root/models/Qwen3.6-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/root/models/tim_tmp/runtime/qwen3.6-27b', result_filename='bench-20260721-074143.json', ignore_eos=False, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-9e5282be-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body={'chat_template_kwargs': {'enable_thinking': False}}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 07-21 07:42:08 [utils.py:90] Sampling input_len from [32768, 32768] and output_len from [1024, 1024]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
100%|██████████| 100/100 [19:04<00:00, 11.45s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Maximum request concurrency:             8         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  1144.78   
Total input tokens:                      3278036   
Total generated tokens:                  102400    
Request throughput (req/s):              0.09      
Output token throughput (tok/s):         89.45     
Peak output token throughput (tok/s):    129.00    
Peak concurrent requests:                10.00     
Total token throughput (tok/s):          2952.92   
---------------Time to First Token----------------
Mean TTFT (ms):                          14535.52  
Median TTFT (ms):                        8085.35   
P99 TTFT (ms):                           91436.93  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          73.46     
Median TPOT (ms):                        73.49     
P99 TPOT (ms):                           121.05    
---------------Inter-token Latency----------------
Mean ITL (ms):                           210.98    
Median ITL (ms):                         74.32     
P99 ITL (ms):                            3459.85   
---------------Speculative Decoding---------------
Acceptance rate (%):                     62.37     
Acceptance length:                       2.87      
Drafts:                                  35673     
Draft tokens:                            107019    
Accepted tokens:                         66745     
Per-position acceptance (%):
  Position 0:                            80.65     
  Position 1:                            60.86     
  Position 2:                            45.59     
==================================================